nrfconnect/nrf70-bm/nrf70_bm_lib/source/nrf70_bm_core.c
/*
 * Copyright (c) 2024 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/** @file
 * @brief nRF70 Bare Metal initialization.
 */
#ifdef CONFIG_NRF70_RANDOM_MAC_ADDRESS
#include <zephyr/random/random.h>
#endif /* CONFIG_NRF70_RANDOM_MAC_ADDRESS */

#include "nrf70_bm_lib.h"
#include "nrf70_bm_core.h"

#include "util.h"
#include "fmac_api.h"
#include "fmac_util.h"

#ifdef CONFIG_NRF700X_BOARD_TYPE_DK
#include "nrf70_tx_pwr_ceil_dk.h"
#elif CONFIG_NRF700X_BOARD_TYPE_EK
#include "nrf70_tx_pwr_ceil_ek.h"
#else
#error "Please prepare tx power ceiling header file for your board"
#endif

struct nrf70_wifi_drv_priv_bm nrf70_bm_priv;

/* INCBIN macro Taken from https://gist.github.com/mmozeiko/ed9655cf50341553d282 */
#define STR2(x) #x
#define STR(x) STR2(x)

#ifdef __APPLE__
#define USTR(x) "_" STR(x)
#else
#define USTR(x) STR(x)
#endif

#ifdef _WIN32
#define INCBIN_SECTION ".rdata, \"dr\""
#elif defined __APPLE__
#define INCBIN_SECTION "__TEXT,__const"
#else
#define INCBIN_SECTION ".rodata.*"
#endif

/* this aligns start address to 16 and terminates byte array with explicit 0
 * which is not really needed, feel free to change it to whatever you want/need
 */
#define INCBIN(prefix, name, file) \
	__asm__(".section " INCBIN_SECTION "\n" \
			".global " USTR(prefix) "_" STR(name) "_start\n" \
			".balign 16\n" \
			USTR(prefix) "_" STR(name) "_start:\n" \
			".incbin \"" file "\"\n" \
			\
			".global " STR(prefix) "_" STR(name) "_end\n" \
			".balign 1\n" \
			USTR(prefix) "_" STR(name) "_end:\n" \
			".byte 0\n" \
	); \
	extern __aligned(16)    const char prefix ## _ ## name ## _start[]; \
	extern                  const char prefix ## _ ## name ## _end[];

INCBIN(_bin, nrf70_fw, STR(CONFIG_NRF_WIFI_FW_BIN));


void nrf70_bm_mac_txt(const unsigned char *mac, char *mac_str, size_t size)
{
	if (size < 18) {
		// Handle error: buffer too small
		return;
	}

	snprintf(mac_str, size, "%02X:%02X:%02X:%02X:%02X:%02X",
			 mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
}

static enum nrf_wifi_status nrf_wifi_fw_load(void *rpu_ctx)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_fmac_fw_info fw_info = { 0 };
	uint8_t *fw_start;
	uint8_t *fw_end;

	fw_start = (uint8_t *)_bin_nrf70_fw_start;
	fw_end = (uint8_t *)_bin_nrf70_fw_end;

	status = nrf_wifi_fmac_fw_parse(rpu_ctx, fw_start, fw_end - fw_start,
					&fw_info);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		NRF70_LOG_ERR("%s: nrf_wifi_fmac_fw_parse failed", __func__);
		return status;
	}
	/* Load the FW patches to the RPU */
	status = nrf_wifi_fmac_fw_load(rpu_ctx, &fw_info);

	if (status != NRF_WIFI_STATUS_SUCCESS) {
		NRF70_LOG_ERR("%s: nrf_wifi_fmac_fw_load failed", __func__);
	}

	return status;
}

#ifndef CONFIG_NRF70_RADIO_TEST
static void reg_change_callbk_fn(void *vif_ctx,
			  struct nrf_wifi_event_regulatory_change *reg_change_event,
			  unsigned int event_len)
{
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;

	(void)vif_ctx;
	(void)event_len;

	NRF70_LOG_DBG("Regulatory change event received");

	fmac_dev_ctx = nrf70_bm_priv.rpu_ctx_bm.rpu_ctx;

	fmac_dev_ctx->reg_change = nrf_wifi_osal_mem_alloc(fmac_dev_ctx->fpriv->opriv,
							   sizeof(struct nrf_wifi_event_regulatory_change));
	if (!fmac_dev_ctx->reg_change) {
		NRF70_LOG_ERR("%s: Failed to allocate memory for reg_change", __func__);
		return;
	}

	memcpy(fmac_dev_ctx->reg_change,
		   reg_change_event,
		   sizeof(struct nrf_wifi_event_regulatory_change));
	fmac_dev_ctx->reg_set_status = true;
}

static void nrf_wifi_event_proc_scan_start_zep(void *vif_ctx,
				struct nrf_wifi_umac_event_trigger_scan *scan_start_event,
				unsigned int event_len)
{
	NRF70_LOG_DBG("Scan started event received");
}

static void nrf_wifi_event_proc_scan_done_zep(void *vif_ctx,
				struct nrf_wifi_umac_event_trigger_scan *scan_done_event,
				unsigned int event_len)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf70_wifi_vif_bm *vif = vif_ctx;
	void *rpu_ctx = nrf70_bm_priv.rpu_ctx_bm.rpu_ctx;
	NRF70_LOG_DBG("Scan done event received");

	status = nrf_wifi_fmac_scan_res_get(rpu_ctx,
					    vif->vif_idx,
					    SCAN_DISPLAY);

	if (status != NRF_WIFI_STATUS_SUCCESS) {
		NRF70_LOG_ERR("%s: failed", __func__);
		goto err;
	}
err:
	return;
}

static inline enum nrf70_mfp_options drv_to_bm_mfp(unsigned char mfp_flag)
{
	if (!mfp_flag)
		return NRF70_MFP_DISABLE;
	if (mfp_flag & NRF_WIFI_MFP_REQUIRED)
		return NRF70_MFP_REQUIRED;
	if (mfp_flag & NRF_WIFI_MFP_CAPABLE)
		return NRF70_MFP_OPTIONAL;

	return NRF70_MFP_UNKNOWN;
}
static inline enum nrf70_security_type drv_to_bm(int drv_security_type)
{
	switch (drv_security_type) {
	case NRF_WIFI_OPEN:
		return NRF70_SECURITY_TYPE_NONE;
	case NRF_WIFI_WEP:
		return NRF70_SECURITY_TYPE_WEP;
	case NRF_WIFI_WPA:
		return NRF70_SECURITY_TYPE_WPA_PSK;
	case NRF_WIFI_WPA2:
		return NRF70_SECURITY_TYPE_PSK;
	case NRF_WIFI_WPA2_256:
		return NRF70_SECURITY_TYPE_PSK_SHA256;
	case NRF_WIFI_WPA3:
		return NRF70_SECURITY_TYPE_SAE;
	case NRF_WIFI_WAPI:
		return NRF70_SECURITY_TYPE_WAPI;
	case NRF_WIFI_EAP:
		return NRF70_SECURITY_TYPE_EAP;
	default:
		return NRF70_SECURITY_TYPE_UNKNOWN;
	}
}

static void nrf_wifi_event_proc_disp_scan_res_zep(void *vif_ctx,
				struct nrf_wifi_umac_event_new_scan_display_results *scan_res,
				unsigned int event_len,
				bool more_res)
{
	struct nrf70_wifi_vif_bm *vif = vif_ctx;
	uint16_t max_bss_cnt = 0;
	struct umac_display_results *r = NULL;
	struct nrf70_scan_result res;
	unsigned int i;


	NRF70_LOG_DBG("Scan result event received");
	max_bss_cnt = vif->max_bss_cnt ?
		vif->max_bss_cnt : CONFIG_NRF_WIFI_SCAN_MAX_BSS_CNT;

	for (i = 0; i < scan_res->event_bss_count; i++) {
		/* Limit the scan results to the configured maximum */
		if ((max_bss_cnt > 0) &&
		    (vif->scan_res_cnt >= max_bss_cnt)) {
			break;
		}

		memset(&res, 0x0, sizeof(res));

		r = &scan_res->display_results[i];

		res.ssid_len = MIN(sizeof(res.ssid), r->ssid.nrf_wifi_ssid_len);

		res.band = r->nwk_band;

		res.channel = r->nwk_channel;

		res.security = drv_to_bm(r->security_type);

