nrfconnect/nrf70-bm/nrf70_bm_lib/source/nrf70_bm_core.c
	rpu_ctx = nrf_wifi_fmac_dev_add(nrf70_bm_priv.fmac_priv,
									&nrf70_bm_priv.rpu_ctx_bm);
	if (!rpu_ctx) {
		NRF70_LOG_ERR("Failed to add device\n");
		goto deinit;
	}

	nrf70_bm_priv.rpu_ctx_bm.rpu_ctx = rpu_ctx;

	status = nrf_wifi_fw_load(rpu_ctx);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		NRF70_LOG_ERR("Failed to load firmware\n");
		goto deinit;
	}

	status = nrf_wifi_fmac_ver_get(rpu_ctx, &fw_ver);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		NRF70_LOG_ERR("Failed to get FMAC version\n");
		goto deinit;
	}

	NRF70_LOG_INF("Firmware (v%d.%d.%d.%d) booted successfully",
		NRF_WIFI_UMAC_VER(fw_ver),
		NRF_WIFI_UMAC_VER_MAJ(fw_ver),
		NRF_WIFI_UMAC_VER_MIN(fw_ver),
		NRF_WIFI_UMAC_VER_EXTRA(fw_ver));

	configure_tx_pwr_settings(&tx_pwr_ctrl_params,
				  &tx_pwr_ceil_params);

	configure_board_dep_params(&board_params);

#ifdef CONFIG_NRF_WIFI_BEAMFORMING
	enable_bf = true;
#endif

#ifndef CONFIG_NRF70_RADIO_TEST
	status = nrf_wifi_fmac_dev_init(rpu_ctx,
#ifdef CONFIG_NRF_WIFI_LOW_POWER
					sleep_type,
#endif /* CONFIG_NRF_WIFI_LOW_POWER */
					NRF_WIFI_DEF_PHY_CALIB,
					op_band,
					enable_bf,
					&tx_pwr_ctrl_params,
					&tx_pwr_ceil_params,
					&board_params);
#else
	status = nrf_wifi_fmac_dev_init_rt(rpu_ctx,
#ifdef CONFIG_NRF_WIFI_LOW_POWER
					sleep_type,
#endif /* CONFIG_NRF_WIFI_LOW_POWER */
					NRF_WIFI_DEF_PHY_CALIB,
					op_band,
					enable_bf,
					&tx_pwr_ctrl_params,
					&tx_pwr_ceil_params,
					&board_params);
#endif /* CONFIG_NRF70_RADIO_TEST */
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		NRF70_LOG_ERR("Failed to initialize device\n");
		goto deinit;
	}

	NRF70_LOG_DBG("FMAC module initialized");

	return 0;
deinit:
	nrf70_fmac_deinit();
err:
	return -1;
}

#ifdef CONFIG_NRF70_RANDOM_MAC_ADDRESS
static void generate_random_mac_address(uint8_t *mac_addr)
{
	// For simplicty use Zephyr API to generate random number
	for (int i = 0; i < 6; i++) {
		mac_addr[i] = sys_rand8_get();
	}

	// Set the locally administered bit (bit 1 of the first byte)
	mac_addr[0] |= 0x02;

	// Clear the multicast bit (bit 0 of the first byte)
	mac_addr[0] &= 0xFE;
}
#endif /* CONFIG_WIFI_RANDOM_MAC_ADDRESS */

enum nrf_wifi_status nrf_wifi_get_mac_addr(struct nrf70_wifi_vif_bm *vif,
					   uint8_t *mac_addr)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
#ifdef CONFIG_NRF70_OTP_MAC_ADDRESS
	void *rpu_ctx = nrf70_bm_priv.rpu_ctx_bm.rpu_ctx;
#endif /* CONFIG_NRF70_RANDOM_MAC_ADDRESS */
	struct nrf_wifi_fmac_priv *fmac_priv = nrf70_bm_priv.fmac_priv;
	unsigned char mac_addr_str[13];
#ifdef CONFIG_NRF70_FIXED_MAC_ADDRESS_ENABLED
	int ret;
	char fixed_mac_addr[NR70_MAC_ADDR_LEN];
#endif /* CONFIG_NRF70_FIXED_MAC_ADDRESS_ENABLED */

	/* Runtime takes precedence over any other method */
	if (mac_addr) {
		memcpy(vif->mac_addr, mac_addr, NR70_MAC_ADDR_LEN);
		goto mac_addr_check;
	}

#ifdef CONFIG_NRF70_FIXED_MAC_ADDRESS_ENABLED
	if (strlen(CONFIG_NRF70_FIXED_MAC_ADDRESS) != 2 * NR70_MAC_ADDR_LEN) {
		NRF70_LOG_ERR("Invalid fixed MAC address format: len = %d",
			strlen(CONFIG_NRF70_FIXED_MAC_ADDRESS));
		return NRF_WIFI_STATUS_FAIL;
	}


	ret = nrf_wifi_utils_hex_str_to_val(nrf70_bm_priv.fmac_priv->opriv,
					    fixed_mac_addr,
					    NR70_MAC_ADDR_LEN,
					    CONFIG_NRF70_FIXED_MAC_ADDRESS);
	if (ret < 0) {
		NRF70_LOG_ERR("%s: Failed to parse MAC address: %s",
					 __func__,
					 CONFIG_NRF70_FIXED_MAC_ADDRESS);
		goto err;
	}

	memcpy(vif->mac_addr, fixed_mac_addr, NR70_MAC_ADDR_LEN);
#elif CONFIG_NRF70_RANDOM_MAC_ADDRESS
	generate_random_mac_address(vif->mac_addr);
#elif CONFIG_NRF70_OTP_MAC_ADDRESS
	status = nrf_wifi_fmac_otp_mac_addr_get(rpu_ctx,
											vif->vif_idx,
											vif->mac_addr);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		NRF70_LOG_ERR("%s: Fetching of MAC address from OTP failed",
			__func__);
		goto err;
	}
#endif
mac_addr_check:
	nrf70_bm_mac_txt(vif->mac_addr, mac_addr_str, sizeof(mac_addr_str));
	if (!nrf_wifi_utils_is_mac_addr_valid(fmac_priv->opriv,
	    vif->mac_addr)) {
		NRF70_LOG_ERR("%s: Invalid MAC address: %s",
			__func__,
			mac_addr_str);
		status = NRF_WIFI_STATUS_FAIL;
		memset(vif->mac_addr, 0, NR70_MAC_ADDR_LEN);
		goto err;
	}
	status = NRF_WIFI_STATUS_SUCCESS;
err:
	return status;
}

#ifndef CONFIG_NRF70_RADIO_TEST
#define STA_VIF_NAME "wlan0"
int nrf70_fmac_add_vif_sta(uint8_t *mac_addr)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_umac_add_vif_info add_vif_info;
	struct nrf_wifi_umac_chg_vif_state_info vif_info;
	void *rpu_ctx = nrf70_bm_priv.rpu_ctx_bm.rpu_ctx;
	struct nrf70_wifi_vif_bm *vif = &nrf70_bm_priv.rpu_ctx_bm.vifs[0];

	if (!rpu_ctx) {
		NRF70_LOG_ERR("%s: RPU context is NULL", __func__);
		return -1;
	}
	add_vif_info.iftype = NRF_WIFI_IFTYPE_STATION;

	memcpy(add_vif_info.ifacename, STA_VIF_NAME, strlen(STA_VIF_NAME));

	vif->vif_idx = nrf_wifi_fmac_add_vif(rpu_ctx, vif, &add_vif_info);
	if (vif->vif_idx >= MAX_NUM_VIFS) {
		NRF70_LOG_ERR("%s: FMAC returned invalid interface index", __func__);
		goto err;
	}

	status = nrf_wifi_get_mac_addr(vif, mac_addr);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		NRF70_LOG_ERR("%s: Failed to get MAC address", __func__);
		goto del_vif;
	}

	status = nrf_wifi_fmac_set_vif_macaddr(rpu_ctx, vif->vif_idx, vif->mac_addr);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		NRF70_LOG_ERR("%s: Failed to set MAC address", __func__);
		goto del_vif;
	}

	NRF70_LOG_INF("MAC address set to %02X:%02X:%02X:%02X:%02X:%02X",
		vif->mac_addr[0], vif->mac_addr[1], vif->mac_addr[2],
		vif->mac_addr[3], vif->mac_addr[4], vif->mac_addr[5]);

	memset(&vif_info, 0, sizeof(vif_info));
	vif_info.state = NRF_WIFI_FMAC_IF_OP_STATE_UP;
	vif_info.if_index = vif->vif_idx;

	status = nrf_wifi_fmac_chg_vif_state(rpu_ctx, vif->vif_idx, &vif_info);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		NRF70_LOG_ERR("%s: Failed to set interface state", __func__);
		goto del_vif;
	}

	vif->op_state = NRF_WIFI_FMAC_IF_OP_STATE_UP;

	NRF70_LOG_DBG("STA interface added successfully");

	return 0;

del_vif:
	status = nrf_wifi_fmac_del_vif(rpu_ctx, vif->vif_idx);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		NRF70_LOG_ERR("%s: Failed to delete interface", __func__);
	}
err:
	return -1;
}


