nrfconnect/nrf70-bm/nrf70_bm_lib/source/nrf70_bm_core.c
int nrf70_fmac_del_vif_sta(void)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_umac_chg_vif_state_info vif_info;
	void *rpu_ctx = nrf70_bm_priv.rpu_ctx_bm.rpu_ctx;
	struct nrf70_wifi_vif_bm *vif = &nrf70_bm_priv.rpu_ctx_bm.vifs[0];

	if (!rpu_ctx) {
		NRF70_LOG_ERR("%s: RPU context is NULL", __func__);
		return -1;
	}

	memset(&vif_info, 0, sizeof(vif_info));
	vif_info.state = NRF_WIFI_FMAC_IF_OP_STATE_DOWN;
	vif_info.if_index = vif->vif_idx;

	status = nrf_wifi_fmac_chg_vif_state(rpu_ctx, vif->vif_idx, &vif_info);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		NRF70_LOG_ERR("%s: Failed to set interface state", __func__);
		goto err;
	}

	status = nrf_wifi_fmac_del_vif(rpu_ctx, vif->vif_idx);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		NRF70_LOG_ERR("%s: Failed to delete interface", __func__);
		goto err;
	}

	NRF70_LOG_DBG("STA interface deleted successfully");

	return 0;
err:
	return -1;
}

int nrf70_fmac_get_reg(struct nrf70_regulatory_info *reg_info)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	void *rpu_ctx = nrf70_bm_priv.rpu_ctx_bm.rpu_ctx;
	struct nrf_wifi_fmac_reg_info reg_info_fmac = { 0 };
	struct nrf70_reg_chan_info *tmp_chan_info_out = NULL;
	struct nrf_wifi_get_reg_chn_info *tmp_chan_info_in = NULL;
	int chan_idx;

	if (!rpu_ctx) {
		NRF70_LOG_ERR("%s: RPU context is NULL", __func__);
		goto err;
	}

	status = nrf_wifi_fmac_get_reg(rpu_ctx, &reg_info_fmac);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		NRF70_LOG_ERR("%s: %d Failed to get regulatory info", __func__, status);
		goto err;
	}

	memcpy(reg_info->country_code, reg_info_fmac.alpha2, NRF_WIFI_COUNTRY_CODE_LEN);
	reg_info->num_channels = reg_info_fmac.reg_chan_count;

	if (!reg_info->chan_info) {
		NRF70_LOG_ERR("%s: Channel info buffer is NULL", __func__);
		goto err;
	}

	if (reg_info->num_channels > NRF70_MAX_CHANNELS) {
		NRF70_LOG_ERR("%s: Number of channels exceeds maximum supported (%d)",
			__func__, NRF70_MAX_CHANNELS);
		goto err;
	}

	for (chan_idx = 0; chan_idx < reg_info_fmac.reg_chan_count; chan_idx++) {
		tmp_chan_info_out = &(reg_info->chan_info[chan_idx]);
		tmp_chan_info_in = &(reg_info_fmac.reg_chan_info[chan_idx]);
		tmp_chan_info_out->center_frequency = tmp_chan_info_in->center_frequency;
		tmp_chan_info_out->dfs = !!tmp_chan_info_in->dfs;
		tmp_chan_info_out->max_power = tmp_chan_info_in->max_power;
		tmp_chan_info_out->passive_only = !!tmp_chan_info_in->passive_channel;
		tmp_chan_info_out->supported = !!tmp_chan_info_in->supported;
	}
	return 0;
err:
	return -1;
}

int nrf70_fmac_set_reg(struct nrf70_regulatory_info *reg_info)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	void *rpu_ctx = nrf70_bm_priv.rpu_ctx_bm.rpu_ctx;
	struct nrf_wifi_fmac_reg_info reg_info_fmac = { 0 };

	if (!rpu_ctx) {
		NRF70_LOG_ERR("%s: RPU context is NULL", __func__);
		goto err;
	}

	memcpy(reg_info_fmac.alpha2, reg_info->country_code, NRF_WIFI_COUNTRY_CODE_LEN);
	reg_info_fmac.force = reg_info->force;

	status = nrf_wifi_fmac_set_reg(rpu_ctx, &reg_info_fmac);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		NRF70_LOG_ERR("%s: Failed to set regulatory info", __func__);
		goto err;
	}

	return 0;
err:
	return -1;
}

#endif /* CONFIG_NRF70_RADIO_TEST */

int nrf70_fmac_deinit(void)
{
	NRF70_LOG_DBG("Deinitializing FMAC module");

#ifndef CONFIG_NRF70_RADIO_TEST
	if (nrf70_bm_priv.rpu_ctx_bm.rpu_ctx) {
		nrf_wifi_fmac_dev_deinit(nrf70_bm_priv.rpu_ctx_bm.rpu_ctx);
		nrf_wifi_fmac_dev_rem(nrf70_bm_priv.rpu_ctx_bm.rpu_ctx);
	}
	if (nrf70_bm_priv.fmac_priv) {
		nrf_wifi_fmac_deinit(nrf70_bm_priv.fmac_priv);
	}
#else
	if (nrf70_bm_priv.rpu_ctx_bm.rpu_ctx) {
		nrf_wifi_fmac_dev_deinit_rt(nrf70_bm_priv.rpu_ctx_bm.rpu_ctx);
		nrf_wifi_fmac_dev_rem_rt(nrf70_bm_priv.rpu_ctx_bm.rpu_ctx);
	}
	if (nrf70_bm_priv.fmac_priv) {
		nrf_wifi_fmac_deinit_rt(nrf70_bm_priv.fmac_priv);
	}
#endif /* CONFIG_NRF70_RADIO_TEST */

	nrf70_bm_priv.fmac_priv = NULL;
	nrf70_bm_priv.rpu_ctx_bm.rpu_ctx = NULL;

	NRF70_LOG_DBG("FMAC module deinitialized");

	return 0;
}